glcloud/keil_v5/ARM/PACK/.Web/NXP.MK11D5_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <vendor>NXP</vendor>
  <name>MK11D5_DFP</name>
  <description>Device Family Pack for MK11D5</description>
  <license>Licenses.txt</license>
  <url>http://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <releases>
    <release version="10.0.1">NXP CMSIS packs based on MCUXpresso SDK 2.3.1</release>
    <release version="10.0.0">NXP CMSIS packs with updated Clear BSD license, based on MCUXpresso SDK 2.3.0. NXP CMSIS pack will maintain independent versioning starting with 10.0.0</release>
    <release version="2.3.0">NXP MCUXpresso SDK 2.3.0 CMSIS packs with updated Clear BSD license</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Device Startup</description>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="Device" Cgroup="SDK Project Template">NXP MCUXpresso SDK RTE Device Project Template</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
  </taxonomy>
  <devices>
    <family Dfamily="MK11D5" Dvendor="NXP:11">
      <description>The Kinetis(r) K11 50 MHz baseline MCUs, built on the ARM(r) Cortex(r)-M4 core, are optimized for cost-sensitive applications requiring low-power, security encryption, tamper detection and processing efficiency. This family shares the comprehensive enablement and scalability of the Kinetis portfolio.</description>
      <device Dname="MK11DN512xxx5">
        <processor Dcore="Cortex-M4" Dfpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MK11DN512xxx5_flash.icf"/>
        </environment>
        <memory name="FLEX_RAM" access="rw" start="0x14000000" size="0x1000"/>
        <memory name="PROGRAM_FLASH" access="rx" start="0x00000000" size="0x080000" startup="1" default="1"/>
        <memory name="SRAM_LOWER" access="rw" start="0x1fff8000" size="0x8000" default="1"/>
        <memory name="SRAM_UPPER" access="rw" start="0x20000000" size="0x8000"/>
        <algorithm name="arm/MK_P512_50MHZ.FLM" start="0x00000000" size="0x00080000" default="1"/>
        <debug svd="MK11D5.xml"/>
        <variant Dvariant="MK11DN512VLK5">
          <compile header="fsl_device_registers.h" define="CPU_MK11DN512VLK5"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK11DN512VLK5/MK11DN512xxx5_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK11DN512VMC5">
          <compile header="fsl_device_registers.h" define="CPU_MK11DN512VMC5"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK11DN512VMC5/MK11DN512xxx5_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
      <device Dname="MK11DX128xxx5">
        <processor Dcore="Cortex-M4" Dfpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MK11DX128xxx5_flash.icf"/>
        </environment>
        <memory name="FLEX_NVM" access="rx" start="0x10000000" size="0x010000"/>
        <memory name="FLEX_RAM" access="rw" start="0x14000000" size="0x1000"/>
        <memory name="PROGRAM_FLASH" access="rx" start="0x00000000" size="0x020000" startup="1" default="1"/>
        <memory name="SRAM_LOWER" access="rw" start="0x1fffc000" size="0x4000" default="1"/>
        <memory name="SRAM_UPPER" access="rw" start="0x20000000" size="0x4000"/>
        <algorithm name="arm/MK_D64_50MHZ.FLM" start="0x10000000" size="0x00010000" default="1"/>
        <algorithm name="arm/MK_P128_50MHZ.FLM" start="0x00000000" size="0x00020000" default="1"/>
        <debug svd="MK11D5.xml"/>
        <variant Dvariant="MK11DX128VLK5">
          <compile header="fsl_device_registers.h" define="CPU_MK11DX128VLK5"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK11DX128VLK5/MK11DX128xxx5_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK11DX128VMC5">
          <compile header="fsl_device_registers.h" define="CPU_MK11DX128VMC5"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK11DX128VMC5/MK11DX128xxx5_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
      <device Dname="MK11DX256xxx5">
        <processor Dcore="Cortex-M4" Dfpu="0" Dendian="Little-endian" Dclock="50000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MK11DX256xxx5_flash.icf"/>
        </environment>
        <memory name="FLEX_NVM" access="rx" start="0x10000000" size="0x010000"/>
        <memory name="FLEX_RAM" access="rw" start="0x14000000" size="0x1000"/>
        <memory name="PROGRAM_FLASH" access="rx" start="0x00000000" size="0x040000" startup="1" default="1"/>
        <memory name="SRAM_LOWER" access="rw" start="0x1fffc000" size="0x4000" default="1"/>
        <memory name="SRAM_UPPER" access="rw" start="0x20000000" size="0x4000"/>
        <algorithm name="arm/MK_D64_50MHZ.FLM" start="0x10000000" size="0x00010000" default="1"/>
        <algorithm name="arm/MK_P256_50MHZ.FLM" start="0x00000000" size="0x00040000" default="1"/>
        <debug svd="MK11D5.xml"/>
        <variant Dvariant="MK11DX256VLK5">
          <compile header="fsl_device_registers.h" define="CPU_MK11DX256VLK5"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK11DX256VLK5/MK11DX256xxx5_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK11DX256VMC5">
          <compile header="fsl_device_registers.h" define="CPU_MK11DX256VMC5"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK11DX256VMC5/MK11DX256xxx5_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="cond_MCUXpressoConfigTools">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <accept Dname="MK11DN512???5" Dvendor="NXP:11"/>
      <accept Dname="MK11DX128???5" Dvendor="NXP:11"/>
      <accept Dname="MK11DX256???5" Dvendor="NXP:11"/>
    </condition>
    <condition id="devices.MK11D5_device.MK11D5_device.MK11D5_startup_device.device_device_driver.clock_driver.common_driver.gpio_driver.port_driver.smc_driver.uart_utility.debug_console">
      <accept Dvendor="NXP:11" Dname="MK11DN512???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX128???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX256???5"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flash"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smc"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="RTE_Device_platform.CMSIS_Driver_Include.SPI_CMSISInclude_device.MK11D5_driver.dspi">
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <accept Dvendor="NXP:11" Dname="MK11DN512???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX128???5"/>
      <accept Dvendor="NXP:11" Dname="MK11DX256???5"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Csub="dspi_cmsis" Capiversion="5.0.1"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
